#+BEGIN_COMMENT
MIT License

Copyright (c) 2019-2020 Freja Nordsiek

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
#+END_COMMENT

#+STARTUP: inlineimages:t
#+OPTIONS: tex:t author:t creator:nil
#+OPTIONS: H:4 toc:t toc:3 title:t num:t f:t email:t

#+BIND: org-src-preserve-indentation t

#+AUTHOR: Freja Nordsiek
#+TITLE: NumeriCL Documentation
#+EMAIL: fnordsie@posteo.net
#+LANGUAGE: en
#+DESCRIPTION: NumeriCL's documentation for how to use it, how it works, and its code.
#+KEYWORDS: NumeriCL numerics array math lisp

#+HTML_DOCTYPE: html5
#+HTML_MATHJAX: path:"MathJax/MathJax.js?config=TeX-AMS-MML_HTMLorMML"
#+HTML_CONTAINER: section
#+HTML_LINK_HOME: "/"
#+OPTIONS: html-preamble:t html-postamble:auto html5-fancy:t
#+BIND: org-html-coding-system 'utf-8-unix
#+BIND: org-html-wrap-src-lines t

#+LATEX_COMPILER: lualatex
#+LATEX_CLASS_OPTIONS: [a4paper]
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage[a4paper,margin=1.5cm]{geometry}
#+LATEX_HEADER: \usepackage{xcolor}

#+BEGIN_COMMENT
** Running Unit Tests

   The result of running all of the unit-tests, with color turned off (limitations of {{{orgmode}}} export), is done below.
   Normally at the REPL, the methodology in the ~let*~ form wouldn't need to be done.
   But it must be here because the ~prove~ package isn't loaded before compiling the code if it is the first code run in a session.
   The code does the loading and then must disable color and call ~prove:run~ in a very indirect fashion.

   #+NAME: running-unit-tests
   #+BEGIN_SRC lisp -n :results output :exports both
(let ((*standard-output* (make-broadcast-stream))
      (*error-output* (make-broadcast-stream)))
  (asdf:load-systems :numericl-tests))
(let* ((sym (find-symbol "*ENABLE-COLORS*" 'prove))
       (value (symbol-value sym)))
  (unwind-protect
       (progn (setf (symbol-value sym) nil)
              (funcall (symbol-function (find-symbol "RUN" 'prove))
                       :numericl-tests :reporter :fiveam))
    (setf (symbol-value sym) value)))
   #+END_SRC

   #+RESULTS: running-unit-tests
   #+begin_example
   To load "numericl-tests":
     Load 1 ASDF system:
       numericl-tests
   ; Loading "numericl-tests"


   Running a test file '/home/fnordsie/projects/cl/myprojects/numericl/tests/check-typed-list-vector-macros.lisp'
   ..........
    Did 10 checks.
       Pass: 10 (100%)
       Fail: 0 (  0%)

   Summary:
     All 1 file passed.
   #+end_example

